import unittest

from settings.classes.account import AccountFile
from settings.classes.bank import BankFile


class TestCalc(unittest.TestCase):

##############################################################################################################


    bank_file_dict = {
        'Алхимово': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\Для тестов\4. Сверка на 30.06.2023г\Москва и МО\Алхимово R\EscrowBalanceReports_01.06.2023-03.07.2023.xlsx",
            'sum': 10187572679.15,
            'bank_folder': '', # 10187572679,15
            'bank_name': ['СБЕР'],
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Томилино': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Томилино Парк\CommonDeveloper_01.07.2023_5027240182.xlsx",
            'bank_folder': '',
            'sum': 5172982501.07,
            'bank_name': ['ВТБ'], # 5172982501.07
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Верейская': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\Для тестов\4. Сверка на 30.06.2023г\Москва и МО\Верейская 41\30.06.2023.xlsx",
            'bank_folder': '',
            'sum': 3983692163.11,
            'bank_name': ['МКБ'], # 3983692163.11
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Горки Парк': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\Для тестов\4. Сверка на 30.06.2023г\Москва и МО\Горки Парк, Сам-Коробово\EscrowBalanceReports_01.06.2023-30.06.2023.xlsx",
            'bank_folder': '',
            'sum': 17561930445.34,
            'bank_name': ['СБЕР'], # 17561930445,34
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Дмитров': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Дмитров\Счета ЭСКРОУ_1259682959_2023-07-01.xlsx",
            'sum': 208221224.27,
            'bank_folder': '',
            'bank_name': ['Дом РФ'],  # 208221224,27
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },

        'Егорово Парк': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Егорово Парк, Сам-Жилино\EscrowBalanceReports_01.06.2023-30.06.2023 (1).XLSX",
            'bank_folder': r'',
            'sum': 8232351830.27,
            'bank_name': ['СБЕР'], # 8232351830,27
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Заречье': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Заречье\САМОЛЕТ-ЗАРЕЧЬЕ ФЛ.xlsx",
            'bank_folder': '',
            'sum': 535308235.61,
            'bank_name': ['Совкомбанк'], # 535 308 235,61
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Кирпичник': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Страна\Красный Кирпичник\Открытие 27.06.2023-30.06.2023_ККР.xlsx",
            'bank_folder': '',
            'sum': 2562379079.81,
            'bank_name': ['Совкомбанк'],  # 2 562 379 079,81
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Славянка': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Страна\Славянка\Открытие 23.06.2023-30.06.2023_СЛВ.xlsx",
            'bank_folder': '',
            'sum': 11463552620.65,
            'bank_name': ['Совкомбанк'],  # 11 463 552 620,65
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Иванкино': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Квартал Ивакино (Самолёт-Олимп)\30.06.2023.xlsx",
            'bank_folder': '',
            'sum': 1244216131.54,
            'bank_name': ['МКБ'], # 1244216131.54
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        # # 'Лайково': {
        # #     'bank_file': r"C:\Users\cyril\Desktop\Самолет\НОВЫЕ ОТЧЕТЫ\Сверка на 31.03.2023г\Лайково\Выписки\Счета ЭСКРОУ_1043532145_2023-03-31.xlsx",
        # #     'bank_folder': '',
        # #     'bank_name': ['Дом РФ'],
        # #     'single': True,
        # #     'file_to_bank': dict(),
        # #     'check': False
        # # },
        'Люберцы': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Люберцы\ООО СЗ САМОЛЕТ ДЕВЕЛОПМЕНТ 30.06.2023-02.07.2023 .xlsx",
            'bank_folder': '',
            'sum': 17262142794.48,
            'bank_name': ['Альфа Банк'], # 17262142794.48
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Молжаниново': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Молжаниново\30.06.2023.xlsx",
            'bank_folder': '',
            'sum': 16691519070.91,
            'bank_name': ['МКБ'], # 16691519070.91
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Мытищи': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Мытищи Парк (Самолет-Мытищи)\САМОЛЕТ-МЫТИЩИ    01.06-30.06.xlsx",
            'bank_folder': '',
            'sum': 14677909469.62,
            'bank_name': ['Альфа Банк'], # 14677909469.62
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Новоданиловская': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Новоданиловская 8\Счета ЭСКРОУ_850474049_2023-07-01.xlsx",
            'bank_folder': '',
            'sum': 3583217,
            'bank_name': ['Дом РФ'], # 3583217
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Рублевские кварталы': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Рублёвский квартал\Счета ЭСКРОУ_1043532145_2023-07-01.xlsx",
            'bank_folder': '',
            'sum': 1675833376.08,
            'bank_name': ['Дом РФ'],  # 1675833376,08
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Лаголово': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Страна\Лаголово (Северо-Запад)\Счета ЭСКРОУ_1261853033_2023-07-03.xlsx",
            'bank_folder': '',
            'sum': 414844934,
            'bank_name': ['Дом РФ'],  # 414844934
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Остафьево': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Остафьево (СР-Групп)\CommonDeveloper_01.07.2023_7731319243.xlsx",
            'bank_folder': '',
            'sum': 13901874558.72,
            'bank_name': ['ВТБ'], # 13 901 874 558.72
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Путилково': {
            'bank_file': r'W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\Для тестов\4. Сверка на 30.06.2023г\Москва и МО\Большое Путилково\Путилково 30.06.23.xlsx',
            'bank_folder': '',
            'sum': 8572295226.48,
            'bank_name': ['ГПБ'], # 8572295226.48
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Песочный': {
            'bank_file': r'W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Страна\Песочный\Отчёт банка.xlsx',
            'bank_folder': '',
            'sum': 151574944.68,
            'bank_name': ['ГПБ'],  # 151574944.68
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Сабанеева': {
            'bank_file': r'W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Страна\Сабанеева\Отчёт банка Сабанеева_на_03.07.2023.xlsx',
            'bank_folder': '',
            'sum': 393586585.48,
            'bank_name': ['ГПБ'],  # 393586585.48
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Марьино': {
            'bank_file': r'W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Квартал Марьино\Отчёт банка.xlsx',
            'bank_folder': '',
            'sum': 488570063.68,
            'bank_name': ['ГПБ'],  # 488570063.68
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        # # 'Спутник': {
        # #     'bank_file': '',
        # #     'bank_folder': r'C:\Users\cyril\Desktop\Самолет\3. Ревью на 30.04.2023г\Спутник\Банк',
        # #     'bank_name': '',
        # #     'single': False,
        # #     'file_to_bank': {
        # #         'Отчёт ПСБ.xlsx': (
        # #             r"C:\Users\cyril\Desktop\Самолет\3. Ревью на 30.04.2023г\Спутник\Банк\Отчёт ПСБ.xlsx",
        # #             'ПСБ'),
        # #         'отчет эскроу дом рф 02.04.2023.xlsx': (
        # #             r"C:\Users\cyril\Desktop\Самолет\3. Ревью на 30.04.2023г\Спутник\Банк\отчет эскроу дом рф 02.04.2023.xlsx",
        # #             'Дом РФ'),
        # #         'отчет эскроу совком 31.03.2023.xlsx': (
        # #             r"C:\Users\cyril\Desktop\Самолет\3. Ревью на 30.04.2023г\Спутник\Банк\отчет эскроу совком 31.03.2023.xlsx",
        # #             'Совкомбанк')
        # #     },
        # #     'check': False
        # # },
        'Новое Внуково': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Новое Внуково, Санино 1\EscrowBalanceReports_01.06.2023-30.06.2023.XLSX",
            'bank_folder': r'',
            'sum': 8721472920.89,
            'bank_name': ['СБЕР'], # 8721472920,89
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Прибрежный парк': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Прибрежный парк\EscrowBalanceReports_01.06.2023-01.07.2023.XLSX",
            'bank_folder': r'',
            'sum': 21884664811.37,
            'bank_name': ['СБЕР'], # 21884664811,37
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Пригород Лесное': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Пригород Лесное\EscrowBalanceReports_01.06.2023-03.07.2023.XLSX",
            'bank_folder': '',
            'sum': 19792393583.43,
            'bank_name': ['СБЕР'], # 19792393583,43
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Пятницкие кварталы': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Пятницкие луга (Юрлово)\Юрлово общий отчет _01.05.2023-30.06.2023.XLSX",
            'bank_folder': '',
            'sum': 7008246133.72,
            'bank_name': ['СБЕР'],  # 7008246133,72
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Тропарево Парк': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Тропарёво Парк, Сам-Дудкино\EscrowBalanceReports_01.06.2023-30.06.2023.XLSX",
            'bank_folder': '',
            'sum': 2912727483.54,
            'bank_name': ['СБЕР'], # 2912727483,54
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        # # 'Астрид': {
        # #     'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Страна\Астрид (Колпино)\ЖК Астрид г. СанктПе_EscrowReport_01.01.2022-03.07.2023.XLSX",
        # #     'bank_folder': '',
        # #     'sum': 101271922.55,
        # #     'bank_name': ['СБЕР'],  # 101271922,55
        # #     'single': True,
        # #     'file_to_bank': dict(),
        # #     'check': False
        # # },
        'Лаврики': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Страна\Лаврики\EscrowBalanceReports_01.01.2022-03.07.2023.XLSX",
            'bank_folder': '',
            'sum': 91382497.89,
            'bank_name': ['СБЕР'],  # 91382497,89
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Сабурово': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Сабурово-1\Отчёт банка.xlsx",
            'bank_folder': '',
            'sum': 299856161.42,
            'bank_name': ['ГПБ'], # 299856161.42
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },
        'Долина Яузы': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Долина Яузы (СЗ Реновация Мытищи)\РЕНОВАЦИЯ-МЫТИЩИ   01.06.23-30.06.23.xlsx",
            'bank_folder': '',
            'sum': 684867885.29,
            'bank_name': ['Альфа Банк'], # 684 867885.29
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },

        'Квартал Западный': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Квартал Западный\ООО СЗ РЕНОВАЦИЯ-МЫТИЩИ 07.06.2023 .xlsx",
            'bank_folder': '',
            'sum': 654193582.83,
            'bank_name': ['Альфа Банк'], # 654193582.83
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },

        'Новое Видное': {
            'bank_file': r"W:\ФИНАНСОВО-ПРАВОВОЙ БЛОК\Дирекция по экономике и финансам\МСФО\Сверка Эскроу\4. Сверка на 30.06.2023г\Москва и МО\Новое Видное - Калиновка\Отчет Калиновка 3006.xlsx",
            'bank_folder': '',
            'sum': 711999926.15,
            'bank_name': ['ГПБ'], # 711999926.15
            'single': True,
            'file_to_bank': dict(),
            'check': False
        },

    }

    control_bank_sum_dict = {'Алхимово': 10187572679.15, 'Томилино': 5172982501.07, 'Верейская': 3291490782,
                 'Горки Парк': 17561930445.34, 'Дмитров': 208221224.27, 'Егорово Парк': 8232351830.27,
                 'Заречье': 535308235.61, 'Кирпичник': 2562379079.81, 'Славянка': 11463552620.65,
                 'Иванкино': 1127296134, 'Люберцы': 17262142794.48, 'Молжаниново': 14655273176,
                 'Мытищи': 14677909469.62, 'Новоданиловская': 3583217, 'Рублевские кварталы': 1675833376.08,
                 'Лаголово': 414844934, 'Остафьево': 13901874558.72, 'Путилково': 9200480006,
                 'Песочный': 375863923, 'Сабанеева': 393586585.48, 'Марьино': 488570063.68,
                 'Новое Внуково': 8721472920.89, 'Прибрежный парк': 21884664811.37, 'Пригород Лесное': 19792393583.43,
                 'Пятницкие кварталы': 7008246133.72, 'Тропарево Парк': 2912727483.54, 'Астрид': 101271922.55,
                 'Лаврики': 91382497.89, 'Сабурово': 299856161.42, 'Долина Яузы': 684867885.29,
                 'Квартал Западный': 654193582.83, 'Новое Видное': 711999926.15}

    account_file_dict = \
            {'Алхимово':
                 {'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\Для тестов\\4. Сверка на 30.06.2023г\\Москва и МО\\Алхимово R\\ОСВ.xlsx',
                  'bank_name': ['СБЕР'],
                  'type': True,
                  'sum': 10310035908.63,
                  'check_nomenclature': True,
                  'check_account': False},
             'Томилино':
                 {'account':
                      'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Томилино Парк\\ОСВ.xlsx',
                  'bank_name': ['ВТБ'],
                  'type': True,
                  'sum': 4930324710.35,
                  'check_nomenclature': True,
                  'check_account': False
                  },
             'Верейская': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\Для тестов\\4. Сверка на 30.06.2023г\\Москва и МО\\Верейская 41\\ОСВ.xlsx',
                 'bank_name': ['МКБ'],
                 'type': True,
                 'sum': 2850805653.09,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Горки Парк': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\Для тестов\\4. Сверка на 30.06.2023г\\Москва и МО\\Горки Парк, Сам-Коробово\\ОСВ.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 17561930445.34,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Егорово Парк': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Егорово Парк, Сам-Жилино\\ОСВ.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 8232351830.27,
                 'check_nomenclature': True,
                 'check_account': False},
             'Заречье': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Заречье\\ОСВ.xlsx',
                 'bank_name': ['Совкомбанк'],
                 'type': True,
                 'sum': 2213820785.81,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Иванкино': {
                'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Квартал Ивакино (Самолёт-Олимп)\\ОСВ.xlsx',
                 'bank_name': ['МКБ'],
                 'type': True,
                 'sum': 1127296134.27,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Люберцы': {
                'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Люберцы\\ОСВ.xlsx',
                'bank_name': ['Альфа Банк'],
                'type': True,
                'sum': 17266257588.66,
                'check_nomenclature': True,
                'check_account': False
            },
             'Молжаниново': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Молжаниново\\ОСВ.xlsx',
                 'bank_name': ['МКБ'],
                 'type': True,
                 'sum': 14638737562.41,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Мытищи': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Мытищи Парк (Самолет-Мытищи)\\ОСВ.xlsx',
                 'bank_name': ['Альфа Банк'],
                 'type': True,
                 'sum': 14691736575.52,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Новоданиловская': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Новоданиловская 8\\ОСВ.xlsx',
                 'bank_name': ['Дом РФ'],
                 'type': True,
                 'sum': 168961884.43,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Остафьево': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Остафьево (СР-Групп)\\ОСВ.xlsx',
                 'bank_name': ['ВТБ'],
                 'type': True,
                 'sum': 13901874558.72,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Путилково': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\Для тестов\\4. Сверка на 30.06.2023г\\Москва и МО\\Большое Путилково\\ОСВ.xlsx',
                 'bank_name': ['ГПБ'],
                 'type': True,
                 'sum': 9121851405.64,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Новое Внуково': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Новое Внуково, Санино 1\\ОСВ.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 8721729770.58,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Прибрежный парк': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Прибрежный парк\\ОСВ.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 21884637811.37,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Пригород Лесное': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Пригород Лесное\\ОСВ.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 20180152660.14,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Пятницкие кварталы': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Пятницкие луга (Юрлово)\\Оборотно-сальдовая ведомость по счету 009.СЭ за ... - 2 квартал 2023 г. ООО  СЗ  САМОЛЕТ-ЮРЛОВО.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 7029272419.49,
                 'check_nomenclature': True,
                 'check_account': False
             },
             # 'Спутник': {
             #     'account': 'C:\\Users\\cyril\\Desktop\\Самолет\\3. Ревью на 30.04.2023г\\Спутник\\Оборотно-сальдовая ведомость по счету 009.СЭ за ... - Апрель 2023 г. ООО  СЗ  БУХТА ЛЭНД.xlsx',
             #     'bank_name': ['ПСБ'],
             #     'type': True,
             #     'sum': 11,
             #     'check_nomenclature': True,
             #     'check_account': False
             # },
             'Тропарево Парк': {
                'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Тропарёво Парк, Сам-Дудкино\\ОСВ.xlsx',
                'bank_name': ['СБЕР'],
                'type': True,
                'sum': 2912727460.66,
                'check_nomenclature': True,
                'check_account': False
            },
             'Сабурово': {
                'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Сабурово-1\\ОСВ.xlsx',
                'bank_name': ['ГПБ'],
                'type': True,
                'sum': 299856161.42,
                'check_nomenclature': True,
                'check_account': False
            },
             'Долина Яузы': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Долина Яузы (СЗ Реновация Мытищи)\\ОСВ.xlsx',
                 'bank_name': ['Альфа Банк'],
                 'type': True,
                 'sum': 684867885.29,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Квартал Западный': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Квартал Западный\\ОСВ.xlsx',
                 'bank_name': ['Альфа Банк'],
                 'type': True,
                 'sum': 654193582.83,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Новое Видное': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Новое Видное - Калиновка\\ОСВ.xlsx',
                 'bank_name': ['ГПБ'],
                 'type': True,
                 'sum': 719934699.41,
                 'check_nomenclature': True,
                 'check_account': False
             },
            'Дмитров': {
                'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Дмитров\\ОСВ.xlsx',
                'bank_name': ['СБЕР'],
                'type': True,
                'sum': 208221224.27,
                'check_nomenclature': True,
                'check_account': False
            },
             'Кирпичник': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Страна\\Красный Кирпичник\\ОСВ.xlsx',
                 'bank_name': ['Совкомбанк'],
                 'type': True,
                 'sum': 5812277752.45,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Славянка': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Страна\\Славянка\\ОСВ.xlsx',
                 'bank_name': ['Совкомбанк'],
                 'type': True,
                 'sum': 11463552620.65,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Рублевские кварталы': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Рублёвский квартал\\ОСВ.xlsx',
                 'bank_name': ['Дом РФ'],
                 'type': True,
                 'sum': 1675833376.08,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Лаголово': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Страна\\Лаголово (Северо-Запад)\\ОСВ.xlsx',
                 'bank_name': ['Дом РФ'],
                 'type': True,
                 'sum': 414844934,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Песочный': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Страна\\Песочный\\ОСВ.xlsx',
                 'bank_name': ['ГПБ'],
                 'type': True,
                 'sum': 375863923.39,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Сабанеева': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Страна\\Сабанеева\\ОСВ.xlsx',
                 'bank_name': ['ГПБ'],
                 'type': True,
                 'sum': 393586585.48,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Марьино': {
                'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Москва и МО\\Квартал Марьино\\ОСВ.xlsx',
                 'bank_name': ['ГПБ'],
                 'type': True,
                 'sum': 488570063.68,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Астрид': {
                'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Страна\\Астрид (Колпино)\\ОСВ.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 1555508522.22,
                 'check_nomenclature': True,
                 'check_account': False
             },
             'Лаврики': {
                 'account': 'W:\\ФИНАНСОВО-ПРАВОВОЙ БЛОК\\Дирекция по экономике и финансам\\МСФО\\Сверка Эскроу\\4. Сверка на 30.06.2023г\\Страна\\Лаврики\\ОСВ.xlsx',
                 'bank_name': ['СБЕР'],
                 'type': True,
                 'sum': 91382497.89,
                 'check_nomenclature': True,
                 'check_account': False
             }
    }

    control_account_sum_dict = {'Алхимово': 9293268224.90, 'Верейская': 2606392710.35, 'Горки Парк': 15770419237.49,
                            'Долина Яузы': 566659747.29,
                            'Егорово Парк': 7825507360.25, 'Заречье': 7471434735.75, 'Иванкино': 586885243.11,
                            'Люберцы': 16203119479.74, 'Молжаниново': 13016865517.25, 'Мытищи': 20631435384.17,
                            'Новоданиловская': 7965965716.86,
                            'Остафьево': 11532488374.59, 'Путилково': 11347555216.59, 'Новое Внуково': 15499550131.77,
                            'Прибрежный парк': 20215362063.75,
                            'Пригород Лесное': 3080655346, 'Пятницкие кварталы': 5991205075.03,
                            'Спутник': 13988397306.58, 'Тропарево Парк': 10767356353.62, 'Томилино': 15234802248.21,
                            'Сабурово': 206040623.75, 'Квартал Западный': 323914389.74, 'Новое Видное': 409853223.2}



    def test_bank(self):
        for key, value in self.bank_file_dict.items():
            print(key)
            account = AccountFile(self.account_file_dict[key])
            bank = BankFile(value, account.type_dict)
            number = bank.document_sum
            self.assertEqual(round(number), round(self.control_bank_sum_dict[key]))
    #

    # def test_account(self):
    #     for key, value in self.account_file_dict.items():
    #         number = AccountFile(value).document_sum
    #         self.assertEqual(round(number), round(value['sum']))